app/views/sections/_form.html.erb


		<%= f.input :tournament_id, :collection => Tournament.active.alphabetical.all %>
		<%= f.input :event_id, :collection => Event.active.alphabetical.all %>
---
SELECT "tournaments".* FROM "tournaments" WHERE (tournaments.active = 't') ORDER BY tournaments.name
SELECT "events".* FROM "events" WHERE (events.active = 't') ORDER BY events.name