app/views/sections/_section_students.html.erb

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."section_id" = 12 ORDER BY last_name, first_name
SELECT "registrations".* FROM "registrations" WHERE (student_id = 27) AND (section_id = 12) LIMIT 1
---
          <td><%= student.age %></td>
          <td><%= @registrations.select{ |reg| reg.student_id = student.id}.first.fee_paid ? "Yes" : "No" %></td>
          <td><%= link_to raw("<i class='icon-remove'></i>"), registration_path(Registration.for_student(student.id).for_section(@section.id).first), :method => 'delete', :confirm => 'Are you sure?' %>