app/views/dojo_students/_form.html.erb


    <%= f.input :dojo_id, :collection => Dojo.active.alphabetical.all %>
    <%= f.input :student_id, :collection => Student.active.alphabetical.all %>
---
SELECT "dojos".* FROM "dojos" WHERE (active = 't') ORDER BY name
SELECT "students".* FROM "students" WHERE (students.active = 't') ORDER BY last_name, first_name