app/views/dojo_students/_from_student_form.html.erb

SELECT "dojos".* FROM "dojos" WHERE (active = 't') ORDER BY name
SELECT "dojo_students".* FROM "dojo_students" WHERE "dojo_students"."student_id" = 233
SELECT "students".* FROM "students" WHERE (students.active = 't') ORDER BY last_name, first_name
---

    <%= f.input :dojo_id, collection: Dojo.active.alphabetical.all %>
    <%= f.input :student_id, collection: Student.active.alphabetical.all, selected: @student.id %>