app/views/dojos/_active_dojos.html.erb

          <td><%= dojo.city + ", " + dojo.state %></td>
          <td><%= dojo.current_students.size %></td>
---
SELECT "dojo_students".* FROM "dojo_students" WHERE "dojo_students"."student_id" = 92
SELECT COUNT(*) FROM "dojo_students" WHERE "dojo_students"."dojo_id" = 1