app/controllers/dojos_controller.rb

SELECT "dojos".* FROM "dojos" WHERE (active = 't') ORDER BY name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "dojos" WHERE (active = 't')
---
  def index

    @dojos = Dojo.active.alphabetical.paginate(:page => params[:page]).per_page(10)

SELECT "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "dojo_students".* FROM "dojo_students" WHERE "dojo_students"."student_id" = 292
---
  def show
    require 'will_paginate/array'
    @dojo = Dojo.find(params[:id])
    @dojo_students = (@dojo.current_students.select{|s| s.active==true}).paginate(:page => params[:page]).per_page(5)

SELECT "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @dojo = Dojo.find(params[:id])

INSERT INTO "dojos" ("active", "city", "latitude", "longitude", "name", "state", "street", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["active", true], ["city", "Chicago"], ["latitude", 41.72440100000001], ["longitude", -87.6740389], ["name", "me"], ["state", "IL"], ["street", "9305 S Hoyne ave"], ["zip", "60643"]]
---
  def create
    @dojo = Dojo.new(params[:dojo])

    respond_to do |format|
      if @dojo.save

SELECT "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "dojos" SET "name" = 'NorthSide' WHERE "dojos"."id" = 2
---
  def update
    @dojo = Dojo.find(params[:id])

    respond_to do |format|
      if @dojo.update_attributes(params[:dojo])

SELECT "dojos".* FROM "dojos" WHERE "dojos"."id" = ? LIMIT 1  [["id", "8"]]
---
  def destroy
    @dojo = Dojo.find(params[:id])