app/controllers/dojo_students_controller.rb

SELECT "dojo_students".* FROM "dojo_students" WHERE "dojo_students"."student_id" = 233
SELECT "students".* FROM "students" WHERE (students.active = 't') ORDER BY last_name, first_name
SELECT "dojos".* FROM "dojos" WHERE (active = 't') ORDER BY name
---
  def new
    if params[:from]=="student" then
      @student = Student.find(params[:id])
      if @student.current_dojo.nil?
      @last = nil
      else
        # find last assignment
        @last = @student.dojo_students.select{|ds| ds.end_date.nil?}.first