app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY events.name LIMIT 8 OFFSET 0
---
  def index
    @events = Event.alphabetical.paginate(:page => params[:page]).per_page(8)

INSERT INTO "events" ("active", "name") VALUES (?, ?)  [["active", true], ["name", "yeah"]]
---
  def create
    @event = Event.new(params[:event])
    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "name" = 'Breaking Boards' WHERE "events"."id" = 2
---
  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])