app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @section = Section.find(params[:id])

INSERT INTO "sections" ("active", "event_id", "location", "max_age", "max_rank", "min_age", "min_rank", "round_time", "tournament_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)  [["active", true], ["event_id", 3], ["location", nil], ["max_age", nil], ["max_rank", 10], ["min_age", 35], ["min_rank", 8], ["round_time", nil], ["tournament_id", 1]]
---
  def create
    @section = Section.new(params[:section])
    if @section.save

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "sections" SET "max_age" = 11 WHERE "sections"."id" = 1
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])