app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (students.active = 't') ORDER BY last_name, first_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "students" WHERE (students.active = 't')
---
  def index
    @students = Student.active.alphabetical.paginate(:page => params[:page]).per_page(10)

SELECT "dojo_students".* FROM "dojo_students" WHERE "dojo_students"."student_id" = 56 ORDER BY start_date DESC, end_date DESC
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "56"]]
SELECT "users".* FROM "users" WHERE "users"."student_id" = 56 LIMIT 1
SELECT COUNT(*) FROM "dojo_students" WHERE "dojo_students"."student_id" = 56
SELECT COUNT(*) FROM "registrations" INNER JOIN "sections" ON "sections"."id" = "registrations"."section_id" INNER JOIN "sections" "sections_registrations_join" ON "sections_registrations_join"."id" = "registrations"."section_id" INNER JOIN "events" ON "events"."id" = "sections_registrations_join"."event_id" WHERE "registrations"."student_id" = 56
---
  def show
    @student = Student.find(params[:id])
    @user = User.find_by_student_id(@student.id)
    @dojo_history = @student.dojo_students.chronological.paginate(:page => params[:dojo_page]).per_page(5)
    @registrations = @student.registrations.by_event_name.paginate(:page => params[:reg_page]).per_page(5)

INSERT INTO "students" ("active", "date_of_birth", "first_name", "last_name", "phone", "rank", "waiver_signed") VALUES (?, ?, ?, ?, ?, ?, ?)  [["active", true], ["date_of_birth", Fri, 18 Sep 1992], ["first_name", "john"], ["last_name", "john"], ["phone", "7735699419"], ["rank", 3], ["waiver_signed", true]]
---
  def create
    @student = Student.new(params[:student])
    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "students" SET "waiver_signed" = 't' WHERE "students"."id" = 2
---
  def update
    @student = Student.find(params[:id])
    if @student.update_attributes(params[:student])