app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT "tournaments".* FROM "tournaments" WHERE (tournaments.active = 't') ORDER BY tournaments.name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "tournaments" WHERE (tournaments.active = 't')

  def show
    @tournament = Tournament.find(params[:id])
    @sections = @tournament.sections.active.paginate(:page => params[:page]).per_page(5)
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "sections".* FROM "sections" WHERE "sections"."tournament_id" = 1 AND (sections.active = 't') LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "sections" WHERE "sections"."tournament_id" = 1 AND (sections.active = 't')

  def edit
    @tournament = Tournament.find(params[:id])
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tournament = Tournament.new(params[:tournament])

    respond_to do |format|
      if @tournament.save
---
INSERT INTO "tournaments" ("active", "date", "max_rank", "min_rank", "name") VALUES (?, ?, ?, ?, ?)  [["active", true], ["date", Mon, 29 Apr 2013], ["max_rank", nil], ["min_rank", 2], ["name", "John Goodman"]]

  def update
    @tournament = Tournament.find(params[:id])

    respond_to do |format|
      if @tournament.update_attributes(params[:tournament])
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tournaments" SET "max_rank" = 14 WHERE "tournaments"."id" = 1